public/man/man1/git-stripspace.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-stripspace.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-stripspace.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-stripspace - Remove unnecessary whitespace</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git stripspace [-s | --strip-comments]
git stripspace [-c | --comment-lines]
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Read text, such as commit messages, notes, tags and branch descriptions,
from the standard input and clean it in the manner used by Git.</p>
<p>
With no arguments, this will:</p>
<blockquote>
<p>·</p>
<p>
remove trailing whitespace from all lines</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
collapse multiple consecutive empty lines into one empty line</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
remove empty lines from the beginning and end of the input</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
add a missing <em>\n</em> to the last line if necessary.</p>
</blockquote>
<p>
In the case where the input consists entirely of whitespace characters,
no output will be produced.</p>
<p>
<strong>NOTE</strong>: This is intended for cleaning metadata. Prefer the
<strong>–whitespace=fix</strong> mode of *git-apply*(1) for correcting whitespace of
patches or files in the repository.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>-s, –strip-comments</p>
<blockquote>
<p>Skip and remove all lines starting with a comment character (default
<em>#</em>).</p>
</blockquote>
<p>
-c, –comment-lines</p>
<blockquote>
<p>Prepend the comment character and a blank space to each line. Lines will
automatically be terminated with a newline. On empty lines, only the
comment character will be prepended.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Given the following noisy input with <em>$</em> indicating the end of a line:</p>
<blockquote>
<pre class="example">
|A brief introduction   $
|   $
|$
|A new paragraph$
|# with a commented-out line    $
|explaining lots of stuff.$
|$
|# An old paragraph, also commented-out. $
|      $
|The end.$
|  $
</pre>
</blockquote>
<p>
Use <em>git stripspace</em> with no arguments to obtain:</p>
<blockquote>
<pre class="example">
|A brief introduction$
|$
|A new paragraph$
|# with a commented-out line$
|explaining lots of stuff.$
|$
|# An old paragraph, also commented-out.$
|$
|The end.$
</pre>
</blockquote>
<p>
Use <em>git stripspace –strip-comments</em> to obtain:</p>
<blockquote>
<pre class="example">
|A brief introduction$
|$
|A new paragraph$
|explaining lots of stuff.$
|$
|The end.$
</pre>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
GIT
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
